In [4]:
import sys
sys.version

'3.8.3 (default, Jul  2 2020, 17:30:36) [MSC v.1916 64 bit (AMD64)]'

In [6]:
import numpy
import scipy
import matplotlib
import pandas
import statsmodels

In [8]:
import pymc3

In [9]:
numpy.__version__

'1.18.5'

In [10]:
pandas.__version__

'1.0.5'

In [11]:
scipy.__version__

'1.5.0'

In [12]:
matplotlib.__version__

'3.2.2'

In [13]:
statsmodels.__version__

'0.11.1'

In [14]:
pymc3.__version__

'3.9.3'

In [15]:
import collections

In [17]:
import matplotlib.pyplot as plt

In [18]:
planets = pandas.read_csv(r'Planets.csv')

In [19]:
planets

,Planet,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
0,MERCURY,0.3300,4879,4222.6,57.9,88,47.4,167,0.00000,0,No,Yes,1974-03-29,Mariner 10
1,VENUS,4.8700,"12,104",2802.0,108.2,224.7,35.0,464,92.00000,0,No,No,1962-08-27,Mariner 2
2,EARTH,5.9700,"12,756",24.0,149.6,365.2,29.8,15,1.00000,1,No,Yes,NaN,NaN
3,MOON,0.0730,3475,708.7,NaN,27.3,1.0,-20,0.00000,0,No,No,1959-09-12,Luna 2
4,MARS,0.6420,6792,24.7,227.9,687,24.1,-65,0.01000,2,No,No,1965-07-15,Mariner 4
5,JUPITER,1898.0000,"1,42,984",9.9,778.6,4331,13.1,-110,NaN,67,Yes,Yes,1973-12-04,Pioneer 10
6,SATURN,568.0000,"1,20,536",10.7,1433.5,"10,747",9.7,-140,NaN,62,Yes,Yes,1979-09-01,Pioneer 11
7,URANUS,86.8000,"51,118",17.2,2872.5,"30,589",6.8,-195,NaN,27,Yes,Yes,1986-01-24,Voyager 2
8,NEPTUNE,102.0000,"49,528",16.1,4495.1,"59,800",5.4,-200,NaN,14,Yes,Yes,1989-08-25,Voyager 2
9,PLUTO,0.0146,2370,153.3,5906.4,"90,560",4.7,-225,0.00001,5,No,NaN,2015-07-14,New Horizons

In [20]:
planets['Mass']

0       0.3300
1       4.8700
2       5.9700
3       0.0730
4       0.6420
5    1898.0000
6     568.0000
7      86.8000
8     102.0000
9       0.0146
Name: Mass, dtype: float64

In [21]:
planets.index

RangeIndex(start=0, stop=10, step=1)

In [22]:
planets.loc[0]

Planet                MERCURY
Mass                     0.33
Diameter                 4879
DayLength              4222.6
SunDistance              57.9
OrbitPeriod                88
OrbitVelocity            47.4
MeanTemperature           167
SurfacePressure             0
Moons                       0
Rings                      No
MagneticField             Yes
FirstVisited       1974-03-29
FirstMission       Mariner 10
Name: 0, dtype: object

In [24]:
planets.set_index('Planet')

,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
Planet,,,,,,,,,,,,,
MERCURY,0.3300,4879,4222.6,57.9,88,47.4,167,0.00000,0,No,Yes,1974-03-29,Mariner 10
VENUS,4.8700,"12,104",2802.0,108.2,224.7,35.0,464,92.00000,0,No,No,1962-08-27,Mariner 2
EARTH,5.9700,"12,756",24.0,149.6,365.2,29.8,15,1.00000,1,No,Yes,NaN,NaN
MOON,0.0730,3475,708.7,NaN,27.3,1.0,-20,0.00000,0,No,No,1959-09-12,Luna 2
MARS,0.6420,6792,24.7,227.9,687,24.1,-65,0.01000,2,No,No,1965-07-15,Mariner 4
JUPITER,1898.0000,"1,42,984",9.9,778.6,4331,13.1,-110,NaN,67,Yes,Yes,1973-12-04,Pioneer 10
SATURN,568.0000,"1,20,536",10.7,1433.5,"10,747",9.7,-140,NaN,62,Yes,Yes,1979-09-01,Pioneer 11
URANUS,86.8000,"51,118",17.2,2872.5,"30,589",6.8,-195,NaN,27,Yes,Yes,1986-01-24,Voyager 2
NEPTUNE,102.0000,"49,528",16.1,4495.1,"59,800",5.4,-200,NaN,14,Yes,Yes,1989-08-25,Voyager 2
PLUTO,0.0146,2370,153.3,5906.4,"90,560",4.7,-225,0.00001,5,No,NaN,2015-07-14,New Horizons

In [25]:
planets

,Planet,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
0,MERCURY,0.3300,4879,4222.6,57.9,88,47.4,167,0.00000,0,No,Yes,1974-03-29,Mariner 10
1,VENUS,4.8700,"12,104",2802.0,108.2,224.7,35.0,464,92.00000,0,No,No,1962-08-27,Mariner 2
2,EARTH,5.9700,"12,756",24.0,149.6,365.2,29.8,15,1.00000,1,No,Yes,NaN,NaN
3,MOON,0.0730,3475,708.7,NaN,27.3,1.0,-20,0.00000,0,No,No,1959-09-12,Luna 2
4,MARS,0.6420,6792,24.7,227.9,687,24.1,-65,0.01000,2,No,No,1965-07-15,Mariner 4
5,JUPITER,1898.0000,"1,42,984",9.9,778.6,4331,13.1,-110,NaN,67,Yes,Yes,1973-12-04,Pioneer 10
6,SATURN,568.0000,"1,20,536",10.7,1433.5,"10,747",9.7,-140,NaN,62,Yes,Yes,1979-09-01,Pioneer 11
7,URANUS,86.8000,"51,118",17.2,2872.5,"30,589",6.8,-195,NaN,27,Yes,Yes,1986-01-24,Voyager 2
8,NEPTUNE,102.0000,"49,528",16.1,4495.1,"59,800",5.4,-200,NaN,14,Yes,Yes,1989-08-25,Voyager 2
9,PLUTO,0.0146,2370,153.3,5906.4,"90,560",4.7,-225,0.00001,5,No,NaN,2015-07-14,New Horizons

In [26]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Planet           10 non-null     object
 1   Mass             10 non-null     float64
 2   Diameter         10 non-null     object
 3   DayLength        10 non-null     float64
 4   SunDistance      9 non-null      float64
 5   OrbitPeriod      10 non-null     object
 6   OrbitVelocity    10 non-null     float64
 7   MeanTemperature  10 non-null     int64
 8   SurfacePressure  6 non-null      float64
 9   Moons            10 non-null     int64
 10  Rings            10 non-null     object
 11  MagneticField    9 non-null      object
 12  FirstVisited     9 non-null      object
 13  FirstMission     9 non-null      object
dtypes: float64(5), int64(2), object(7)
memory usage: 1.2+ KB

In [30]:
planets.loc[0]

Planet                MERCURY
Mass                     0.33
Diameter                 4879
DayLength              4222.6
SunDistance              57.9
OrbitPeriod                88
OrbitVelocity            47.4
MeanTemperature           167
SurfacePressure             0
Moons                       0
Rings                      No
MagneticField             Yes
FirstVisited       1974-03-29
FirstMission       Mariner 10
Name: 0, dtype: object

In [32]:
planets.loc[[0, 2]]

,Planet,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
0,MERCURY,0.33,4879,4222.6,57.9,88,47.4,167,0.0,0,No,Yes,1974-03-29,Mariner 10
2,EARTH,5.97,"12,756",24.0,149.6,365.2,29.8,15,1.0,1,No,Yes,NaN,NaN

In [33]:
planets.columns

Index(['Planet', 'Mass', 'Diameter', 'DayLength', 'SunDistance', 'OrbitPeriod',
       'OrbitVelocity', 'MeanTemperature', 'SurfacePressure', 'Moons', 'Rings',
       'MagneticField', 'FirstVisited', 'FirstMission'],
      dtype='object')

In [34]:
planets.set_index('Planet', inplace=True)

In [35]:
planets

,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
Planet,,,,,,,,,,,,,
MERCURY,0.3300,4879,4222.6,57.9,88,47.4,167,0.00000,0,No,Yes,1974-03-29,Mariner 10
VENUS,4.8700,"12,104",2802.0,108.2,224.7,35.0,464,92.00000,0,No,No,1962-08-27,Mariner 2
EARTH,5.9700,"12,756",24.0,149.6,365.2,29.8,15,1.00000,1,No,Yes,NaN,NaN
MOON,0.0730,3475,708.7,NaN,27.3,1.0,-20,0.00000,0,No,No,1959-09-12,Luna 2
MARS,0.6420,6792,24.7,227.9,687,24.1,-65,0.01000,2,No,No,1965-07-15,Mariner 4
JUPITER,1898.0000,"1,42,984",9.9,778.6,4331,13.1,-110,NaN,67,Yes,Yes,1973-12-04,Pioneer 10
SATURN,568.0000,"1,20,536",10.7,1433.5,"10,747",9.7,-140,NaN,62,Yes,Yes,1979-09-01,Pioneer 11
URANUS,86.8000,"51,118",17.2,2872.5,"30,589",6.8,-195,NaN,27,Yes,Yes,1986-01-24,Voyager 2
NEPTUNE,102.0000,"49,528",16.1,4495.1,"59,800",5.4,-200,NaN,14,Yes,Yes,1989-08-25,Voyager 2
PLUTO,0.0146,2370,153.3,5906.4,"90,560",4.7,-225,0.00001,5,No,NaN,2015-07-14,New Horizons

In [36]:
planets.FirstVisited.MERCURY

'1974-03-29'

In [37]:
planets.loc['MERCURY'].FirstVisited

'1974-03-29'

In [38]:
planets.loc['MERCURY', 'FirstVisited']

'1974-03-29'

In [39]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, MERCURY to PLUTO
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Mass             10 non-null     float64
 1   Diameter         10 non-null     object
 2   DayLength        10 non-null     float64
 3   SunDistance      9 non-null      float64
 4   OrbitPeriod      10 non-null     object
 5   OrbitVelocity    10 non-null     float64
 6   MeanTemperature  10 non-null     int64
 7   SurfacePressure  6 non-null      float64
 8   Moons            10 non-null     int64
 9   Rings            10 non-null     object
 10  MagneticField    9 non-null      object
 11  FirstVisited     9 non-null      object
 12  FirstMission     9 non-null      object
dtypes: float64(5), int64(2), object(6)
memory usage: 1.4+ KB

In [40]:
planets.FirstVisited = pandas.to_datetime(planets.FirstVisited)

In [41]:
planets.FirstVisited

Planet
MERCURY   1974-03-29
VENUS     1962-08-27
EARTH            NaT
MOON      1959-09-12
MARS      1965-07-15
JUPITER   1973-12-04
SATURN    1979-09-01
URANUS    1986-01-24
NEPTUNE   1989-08-25
PLUTO     2015-07-14
Name: FirstVisited, dtype: datetime64[ns]

In [42]:
planets.FirstVisited.dt.year

Planet
MERCURY    1974.0
VENUS      1962.0
EARTH         NaN
MOON       1959.0
MARS       1965.0
JUPITER    1973.0
SATURN     1979.0
URANUS     1986.0
NEPTUNE    1989.0
PLUTO      2015.0
Name: FirstVisited, dtype: float64

In [43]:
planets.FirstVisited.dt.month

Planet
MERCURY     3.0
VENUS       8.0
EARTH       NaN
MOON        9.0
MARS        7.0
JUPITER    12.0
SATURN      9.0
URANUS      1.0
NEPTUNE     8.0
PLUTO       7.0
Name: FirstVisited, dtype: float64

In [44]:
planets.FirstVisited.dt.day

Planet
MERCURY    29.0
VENUS      27.0
EARTH       NaN
MOON       12.0
MARS       15.0
JUPITER     4.0
SATURN      1.0
URANUS     24.0
NEPTUNE    25.0
PLUTO      14.0
Name: FirstVisited, dtype: float64

In [45]:
planets.FirstVisited.dt.dayofweek

Planet
MERCURY    4.0
VENUS      0.0
EARTH      NaN
MOON       5.0
MARS       3.0
JUPITER    1.0
SATURN     5.0
URANUS     4.0
NEPTUNE    4.0
PLUTO      1.0
Name: FirstVisited, dtype: float64

In [46]:
planets.FirstVisited.dt.dayofyear

Planet
MERCURY     88.0
VENUS      239.0
EARTH        NaN
MOON       255.0
MARS       196.0
JUPITER    338.0
SATURN     244.0
URANUS      24.0
NEPTUNE    237.0
PLUTO      195.0
Name: FirstVisited, dtype: float64

In [47]:
planets.FirstVisited.dt.month_name

In [48]:
2020 - planets.FirstVisited.dt.year

Planet
MERCURY    46.0
VENUS      58.0
EARTH       NaN
MOON       61.0
MARS       55.0
JUPITER    47.0
SATURN     41.0
URANUS     34.0
NEPTUNE    31.0
PLUTO       5.0
Name: FirstVisited, dtype: float64

Moon was visited 61 years ago